
/*
*****************************[블로그 기술 완료 & 이해 완료]***********************************************

*****************************[모르는 것]*******************************************************
- 일반화 오브젝트 풀링
- LinQ
- 람다
- 델리게이트 체인
- 플로우차트
- 이력서 && 자소서 && 기술문서 잘 써야 취업 할 수 있음 => 시간 타이트 하기 때문에 평소에 배운거 블로그에 정리 잘 하기
- 정보처리기사 따 두면 취업하는데 도움은 됨 
- 코딩테스트 미리미리 공부하기
- 프로젝트 끝나면 바로 기술문서 작성해야 한다고 함.
- 박싱 언 박싱 무조건 알아야 한다고 함 (훑어 보기만 함 https://yeko90.tistory.com/entry/c-%EB%B0%95%EC%8B%B1-%EC%96%B8%EB%B0%95%EC%8B%B1-%EA%B0%9C%EB%85%90 )

*****************************[매일 배운 것 정리]******************************
240307
- 일반화 인터페이스 (0307 약간 배움)
- 추상화 (0307 약간 배움)
- 오버라이드 
240302
- 닷넷 C#과 유니티 C#은 서로 다른 것이라고 함. (어떤 건지 잠깐 훑어 봄)
- namespace 사용법 알아보기 (글 작성 완료 했음)
- 메모릭 패딩 현상 알아보기 (글 작성 완료 했음)
- 윈도우 좌표기, 데카르타 표기가 다르다는데.. 알아보기 , 2D좌표기?(두 점 사이의 거리?), 피타고라스의 정리
- 절차지향 vs 객체지향 알아보기
- c++ 클래스 개념 정리
- 게터 세터
- c++에서는 int GetAge()const {return age;} 이런식으로 const를 적음 내부 멤버변수 값 수정이 안되게 하는게 일반적이라고 함
- OOP에 대해 정리할 것.(약...)캡슐화,추상화,다양성,참조 등등...
240304
- static 한정자 의미 알아보기 / 한정자?
- C# 관련 내용 헷갈릴 땐 c# MS 사이트 가서 문서자료 보는 게 제일 좋다고 함. ( https://learn.microsoft.com/ko-kr/dotnet/csharp/)
- 참조 값 형식의 차이를 알아야 함 힙 스택 (글 정리 완료)
- 앞으로 변수 앞에 const 키워드 사용하기 (상수)
- 생성자 오버로딩..알아봐야 함?
- c#에서의 데이터타입
240306
- 가상함수  [조금 알아봄]
- 오버라이딩  [조금 알아봄]
- 추상화 (추상클래스) [조금 알아봄]
- 인터페이스 [조금 알아봄]
240307
- 배열(Array) > 배열의 빌트인 메서드 알아봄 > 배열의 얕은복사 or 깊은복사 (좀 더 알아봐야함)
- string 개념 > string 관련 빌트인 메서드 알아보기  > string vs stringbuilder 차이 알아보기 (연산을 많이 하는거면 빌더 쓰는게 낫다고 함)
- in [매개변수에서 사용 되는 키워드]
- out [매개변수에서 사용 되는 키워드]
- ref [매개변수]
- params
- string str1 ="abc"할 때 string알아보기
- 스트링 내용이 자주변경 될 것 같으면 스트링 빌더 쓰기
- [불변성 Immutable Type]
- 연산자 오버로딩
240308
- 형식 매개변수 제약하기
- 일반화 메서드가 있고 일반화 클래스가 있음 (일반화 메서드는 블로그에 글 씀)
- 인터페이스 사용해서 
240311
-★ 과제 : 트라이캐치 델리게이트 사용해서 사칙연산 계산기 만들기 [아직 못 함]
- 트라이캐치
- 람다식
- 델리게이트
- 델리게이트체인
- 델리게이트와 이벤트 차이
- Func, action,확장메서드(클래스의 원래 형식을 수정하지 않고 확장해서 사용하는 개념이라는데 사용방법 알아놔야 할듯)

240312
-★ 과제 : 배열을 이용해서 큐를 구현하라.(Enqueue, dequeue, isfull, isempty  [아직 못 함]
- this() 생성자 
- partical, 
- 확장메서드
- IEnumerable
- yield
- 큐,스택

240313
링크, 리크드 리스트

★★해야할 것들
- 과제 1개 해야함 : 계산기 
- 이진트리 
- 통장사본,취업계획서 
- 블로그 정리...!!!
- 
★메모
18 ~ 21 // 개발
22 // 회고록
25 // 발표
*/